#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
google_project_service.run: Refreshing state... [id=torah-anytime-to-podcast/run.googleapis.com]
google_cloud_run_service.rss-service: Refreshing state... [id=locations/us-central1/namespaces/torah-anytime-to-podcast/services/rss-service]
google_cloud_run_service_iam_policy.noauth: Refreshing state... [id=v1/projects/torah-anytime-to-podcast/locations/us-central1/services/rss-service]
google_cloud_run_domain_mapping.rss-service: Refreshing state... [id=locations/us-central1/namespaces/torah-anytime-to-podcast/domainmappings/beta.torahanytimetopodcast.2159295.xyz]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_run_service.beta-rss-service will be created
  + resource "google_cloud_run_service" "beta-rss-service" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "us-central1"
      + name                       = "beta-rss-service"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = (known after apply)
              + generation       = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = 50

              + containers {
                  + image = "gcr.io/torah-anytime-to-podcast/main_server:beta"

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits   = (known after apply)
                      + requests = (known after apply)
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + beta-url = (known after apply)

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @TheBestMoshe, Action: `pull_request`, Working Directory: ``, Workflow: `Run Terraform`*